{
  "videos": [
    {
      "video_id": "zxPR-1wYJpA",
      "title": "Why Pro Players Love the Khmer",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-22T16:56:12Z",
      "thumbnail": "https://i.ytimg.com/vi/zxPR-1wYJpA/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "高棉文明的強大之處並非表面上看起來的大象或攻城武器，而是其極為強勢的早期經濟優勢和獨特的戰術彈性。這些「措辭古怪」的加成讓他們在遊戲前期就能節省大量資源、發動奇襲，並建立起難以攻破的防禦，使其成為職業選手眼中的 S 級文明。",
      "full_summary": "# 為何高棉 (Khmer) 是《世紀帝國2》的頂級文明？\n\n## 重點摘要\n高棉文明的強大之處並非表面上看起來的大象或攻城武器，而是其極為強勢的早期經濟優勢和獨特的戰術彈性。這些「措辭古怪」的加成讓他們在遊戲前期就能節省大量資源、發動奇襲，並建立起難以攻破的防禦，使其成為職業選手眼中的 S 級文明。\n\n## 故事大綱\n- **開場**：影片開頭點出，不像許多文明的強項顯而易見，高棉的實力對新手玩家來說相當隱晦。多數人以為他們是個依賴大象的後期文明，但事實遠非如此。\n- **中段**：影片的核心論點圍繞四大關鍵：\n    1.  **早期經濟節省**：高棉不需蓋軍營即可解鎖馬廄和射箭場，直接省下 175 木材與村民建造時間。此外，農田食物會直接存入國庫，無需等待村民送回，大幅提升了早期食物採集效率與出兵速度。\n    2.  **獨特戰術**：這些優勢催生了其他文明無法複製的戰術，例如極速封建（16 村民無織布機）的斥候快攻，或是 13 分鐘就能升上城堡時代的超快打法，同時經濟依然強勁。\n    3.  **房屋駐紮**：村民可以駐紮在房屋中，這不僅是防守神技（俗稱「跳房子」），更能引誘敵軍、消耗其單位生命值，讓對手在騷擾時投鼠忌器。\n    4.  **蠍子海防線**：城堡時代的弩炮（蠍子）擁有 +1 射程，總射程達到 8，超越了絕大多數遠程單位（如弩兵、投石車），使其在防守時能無損耗地消滅來犯敵軍。\n- **結尾**：影片總結，高棉雖然在遊戲大後期缺少一些關鍵科技，但其從黑暗到城堡時代的統治力，早已奠定勝基。後期的大象只是壓垮對手的「最後一擊」。\n\n## 關鍵見解\n1.  **早期優勢 > 後期優勢**：遊戲初期的資源節省，其影響力遠遠大於後期。高棉的加成完美體現了這一點。\n2.  **打破規則的強大**：跳過前置建築（如軍營）的能力，徹底改變了傳統的開局策略與節奏。\n3.  **防禦即是進攻**：強大的防禦能力（如房屋駐紮）能有效嚇阻對手的攻擊，使其不敢輕易交戰，從而浪費時間與兵力。\n4.  **射程就是真理**：即使只是 +1 的射程優勢，在關鍵時刻也能完全壓制對手的常規部隊，形成無法逾越的防線。\n5.  **真正的實力藏在細節裡**：一個文明的強度可能並非來自其最亮眼的單位，而是那些看似不起眼、甚至「措辭古怪」的經濟與文明加成。\n\n## 精彩時刻\n- **「跳房子 (House hopping)」**：利用房屋駐紮機制，讓村民在敵軍面前反覆進出，不僅能保命，還能消耗敵軍血量，甚至設下陷阱。\n- **8 射程的弩炮**：在城堡時代，這種弩炮能攻擊對手，而對手卻無法還擊，堪稱防守的惡夢。\n- **「高棉整場都在發光發熱」**：點出高棉並非等到大象出場才變強，而是在遊戲的每一個階段都極具威脅性。\n- **無恥的業配**：講者在解釋完高棉的強力戰術後，順勢推銷自己 Patreon 上的付費教學，毫不掩飾。\n\n---\n\n# Why the Khmer are a Top-Tier Civilization in AoE2\n\n## TL;DR\nThe Khmer's power doesn't come from their obvious elephants or siege, but from their incredibly strong early-game economic bonuses and unique strategic flexibility. These \"weirdly worded\" bonuses allow them to save massive resources, execute unique rushes, and build an almost impenetrable defense, making them an S-tier civilization for pro players.\n\n## Story Flow\n- **Beginning**: The video starts by highlighting that unlike many civilizations whose strengths are obvious, the Khmer's power is hidden from casual players. Most assume they are a late-game elephant civilization, but this couldn't be further from the truth.\n- **Middle**: The core argument revolves around four key points:\n    1.  **Early-Game Savings**: The Khmer don't need a barracks to unlock the stable and archery range, saving 175 wood and villager build time. Additionally, their farms drop food directly into the stockpile without needing a drop-off, significantly boosting early-game food income and unit production speed.\n    2.  **Unique Strategies**: These bonuses enable powerful builds other civs can't replicate, like a 16-pop no-loom fast feudal scout rush, or an incredibly fast 13-minute Castle Age time while still having a strong economy.\n    3.  **House Garrisoning**: Villagers can garrison in houses, which is not just a great defensive trick (\"house hopping\") but can also be used to bait enemies and wear down their units, making raids risky for the opponent.\n    4.  **Scorpion Defense**: In Castle Age, their Scorpions get +1 range, for a total of 8 range. This outranges most common ranged units (like crossbows and mangonels), allowing them to destroy attacking armies with zero damage in return.\n- **End**: The video concludes that while the Khmer miss a few key late-game technologies, their dominance from the Dark Age through the Castle Age has already secured the game. The late-game elephants are merely the \"finishing blow.\"\n\n## Key Insights\n1.  **Early-Game Bonuses > Late-Game Bonuses**: Resource savings in the early game are far more impactful than those in the late game, a concept the Khmer's bonuses perfectly exemplify.\n2.  **The Power of Breaking Rules**: The ability to skip prerequisite buildings (like the barracks) fundamentally changes standard opening strategies and tempo.\n3.  **Defense is the Best Offense**: A powerful defensive bonus (like house garrisoning) can effectively deter attacks, making the opponent hesitant to engage and forcing them to waste time and army presence.\n4.  **Range is King**: Even a +1 range advantage can completely neutralize an opponent's standard counters at critical moments, creating an unbreachable defensive line.\n5.  **True Strength is in the Details**: A civilization's power may not lie in its flashiest units, but in subtle, even \"weirdly worded,\" economic and civilization bonuses.\n\n## Notable Moments\n- **\"House hopping\"**: The tactic of repeatedly garrisoning and ungarrisoning villagers in houses to save them, chip away at enemy HP, and even set traps.\n- **The 8-Range Scorpion**: A Castle Age unit that can attack opponents while they can't fight back, making it a defensive nightmare.\n- **\"The Khmer have been shining the entire game\"**: A quote emphasizing that the Khmer are a threat at every stage, long before their famous elephants appear.\n- **The Shameless Plug**: After explaining the Khmer's powerful strategies, the narrator seamlessly transitions into advertising his Patreon guides for executing them."
    },
    {
      "video_id": "JdXZ1b-wX-8",
      "title": "開箱巴黎路邊的公廁！嬙姐聽到驚喜的反應是？【巴黎行EP2】",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-21T12:31:38Z",
      "thumbnail": "https://i.ytimg.com/vi/JdXZ1b-wX-8/mqdefault.jpg",
      "description": "現在透過我的專屬優惠連結 https://nordvpn.com/tainanjosh\n或是結帳時輸入優惠碼【tainanjosh】購買的話，兩年方案可以加贈四個月，三十天無條件退費，不滿意可以隨時取消，申請退款，有需要的朋友可以試試看哦！\n\n歡迎加入我的頻道會員\nhttps://reurl.cc/jnWGm\n每個月75元小額贊助來幫助台南Josh頻道變得更好\n\n台南Josh Line貼圖上架囉\n",
      "short_summary": "一位 YouTuber 記錄了他在巴黎的一天。上半天他獨自探索，品嚐了道地早餐與午餐，體驗了在地文化；下半天與朋友會合，在雨中辛苦爬上凱旋門，最後以豐盛的海鮮晚餐結束這趟充滿驚喜的旅程。",
      "full_summary": "# 巴黎獨旅與奇遇：瑪黑區散步、凱旋門攻頂與海鮮大餐\n\n## 重點摘要\n一位 YouTuber 記錄了他在巴黎的一天。上半天他獨自探索，品嚐了道地早餐與午餐，體驗了在地文化；下半天與朋友會合，在雨中辛苦爬上凱旋門，最後以豐盛的海鮮晚餐結束這趟充滿驚喜的旅程。\n\n## 故事大綱\n- **開場**：影片開始時，主角獨自在巴黎尋找早餐，在一家可愛的甜點店品嚐了美味的堅果塔與咖啡，享受一個人的悠閒時光。\n- **中段**：他前往瑪黑區散步，感受巴黎的街區氛圍，並幽默地「體驗」了路邊的公共小便斗。午餐時，他勇敢嘗試了人生第一次的生牛肉塔。接著，他與朋友「強姐」會合，一同前往凱旋門。他們在雨中爬了284階的旋轉樓梯，過程相當辛苦，充滿了有趣的抱怨。\n- **結尾**：儘管天氣不佳且攀爬過程艱辛，他們登上凱旋門頂端後，被巴黎壯麗的城市規劃與景色深深震撼，覺得一切都值得了。當天行程的最後，他們享用了一頓豪華的海鮮大餐，品嚐生蠔、蝦與法式肉醬，並興奮地計畫隔天要去地下墓穴探險。\n\n## 關鍵見解\n- **混合式旅行的樂趣**：影片展現了獨自旅行的自由與和朋友同遊的樂趣相結合的完美模式。\n- **勇於嘗試新事物**：無論是第一次吃生牛肉塔，還是品嚐鴨胗醬，旅行中的美食探險是創造難忘回憶的關鍵。\n- **辛苦的付出終有回報**：攀登凱旋門的過程雖然累人，但頂端無與倫比的景色證明了努力是值得的。\n- **壞天氣也能創造獨特體驗**：在雨中遊覽凱旋門，反而成為了他們口中「當地人才會經歷」的深度旅遊體驗。\n- **巴黎對獨自用餐者很友善**：影片中提到，一個人在巴黎的餐廳用餐是很正常的事，完全不會感到奇怪。\n\n## 精彩時刻\n- **公共小便斗初體驗**：發現並使用路邊的開放式小便斗，直呼「地板好濕喔」、「有點噁心」但又覺得是個不錯的體驗。\n- **攀登凱旋門的崩潰**：在狹窄的旋轉樓梯中不斷向上爬，累到開玩笑說這是「海外移地訓練」，還說「出國要及時」，不然老了爬不動。\n- **第一次吃生牛肉塔的反應**：形容口感「很像是鮪魚」，味道充滿香料與檸檬香，表示很好吃。\n- **海鮮大餐的浮誇形容**：吃到新鮮的生蠔後，朋友開玩笑說感覺「肩膀都活動開了」、「可以投100球」，充滿「大海感」。\n\n---\n\n# Paris Solo & Unfiltered: A Walk in Le Marais, Conquering the Arc de Triomphe, and a Seafood Feast\n\n## TL;DR\nA YouTuber documents his day in Paris, starting with solo explorations and culinary firsts. He then meets up with a friend to brave the grueling stairs of the Arc de Triomphe in the rain, capping off the adventure-filled day with a massive seafood dinner.\n\n## Story Flow\n- **Beginning**: The vlogger starts his day alone in Paris, finding breakfast at a charming local patisserie where he enjoys a nut tart and coffee, savoring the quiet solo time.\n- **Middle**: He wanders through the Marais district, soaking in the Parisian atmosphere and humorously \"reviewing\" a public urinal. For lunch, he bravely tries steak tartare for the first time. Later, he meets up with his friend, and they head to the Arc de Triomphe, facing a strenuous, rainy climb up its 284-step spiral staircase, filled with funny complaints.\n- **End**: Despite the tough climb and bad weather, they reach the top and are rewarded with a breathtaking view of Paris's city layout, feeling it was all worthwhile. The day concludes with a lavish seafood dinner, where they try oysters, shrimp, and pâté, and excitedly plan their next day's trip to the Catacombs.\n\n## Key Insights\n- **The Joy of Blended Travel**: The video showcases a perfect travel model that combines the freedom of solo exploration with the fun of traveling with friends.\n- **Dare to Try New Things**: Culinary adventures, like trying steak tartare or duck gizzard pâté for the first time, are key to creating lasting travel memories.\n- **Hard Work Pays Off**: The exhausting climb up the Arc de Triomphe was immediately validated by the unparalleled, stunning view from the top.\n- **Bad Weather Can Create Unique Experiences**: Visiting the Arc de Triomphe in the rain became what they jokingly called an \"in-depth\" experience that only locals would have.\n- **Paris is Solo-Diner Friendly**: The vlogger notes that dining alone in a Parisian restaurant is a completely normal and comfortable experience.\n\n## Notable Moments\n- **First Encounter with a Public Urinal**: Discovering and using an open-air public urinal, exclaiming, \"The floor is so wet!\" and \"It feels a bit gross,\" but still finding it a novel experience.\n- **The Arc de Triomphe Climb Meltdown**: Dramatically complaining while climbing the narrow spiral staircase, joking that it's like \"overseas military training\" and advising people to \"travel while you're young\" before you're too old to climb it.\n- **Reaction to Trying Steak Tartare**: Describing the texture as \"a lot like tuna\" and finding the flavor, full of spices and lemon, to be delicious.\n- **Exaggerated Descriptions at the Seafood Dinner**: After eating fresh oysters, his friend jokes that he feels his \"shoulders have loosened up\" and he \"could pitch 100 balls,\" thanks to the \"feeling of the ocean.\""
    },
    {
      "video_id": "JlKV_q3Cml8",
      "title": "This Civ has the Most ANNOYING Bonus in the Entire Game",
      "published_at": "2025-11-16T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/JlKV_q3Cml8/mqdefault.jpg",
      "short_summary": "職業電競選手 Hera 在一場對三名新手的世紀帝國2比賽中，放棄了快速取勝的機會。他反而給自己設定了一個龐大的「支線任務」：用攻城武器系統性地砍光對手半場的所有樹木，最終徹底摧毀了他們的經濟，迫使他們投降。",
      "full_summary": "# 職業選手的奇葩戰術：在1v3中靠砍光所有樹木獲勝\n\n## 重點摘要\n職業電競選手 Hera 在一場對三名新手的世紀帝國2比賽中，放棄了快速取勝的機會。他反而給自己設定了一個龐大的「支線任務」：用攻城武器系統性地砍光對手半場的所有樹木，最終徹底摧毀了他們的經濟，迫使他們投降。\n\n## 故事大綱\n- **開場**：Hera（世界排名前十）在一場 1v3 的亞馬遜隧道地圖中對抗三位新手玩家。他隨機選到新文明「契丹」，並決定採用早期斥侯快攻來控制地圖中心、奪取聖物，以彌補單人無法貿易的黃金劣勢。\n- **中段**：在初期騷擾成功後，Hera 覺得直接獲勝太無趣，於是開啟了一個瘋狂的支線任務：砍光對手那半邊地圖的所有樹木。他一邊發展經濟，一邊派出大量「火箭炮」（投石車） methodical地清除森林。遊戲變成了一場競賽：Hera 的「伐木」計畫對抗著三名對手逐漸成形的軍隊。\n- **結尾**：對手集結兵力發動猛烈反攻，戰況一度變得緊張。然而，Hera 的「斷木」策略最終奏效，對手因缺乏木材導致經濟完全崩潰，無法補充農田和部隊。Hera 最後在地圖上建起一道巨大的石牆，徹底封鎖了對手，贏得了這場極具娛樂性的比賽。\n\n## 關鍵見解\n1.  **木材比黃金更重要**：在遊戲後期，木材是經濟的命脈。沒有木材，就無法建造農田、建築和大多數單位，經濟會完全停擺。\n2.  **創新的勝利條件**：勝利不只有軍事征服。透過攻擊對手經濟中最基礎的一環（如此處的木材），可以創造出意想不到的勝利條件。\n3.  **享受遊戲的過程**：與其單純地碾壓對手，Hera 選擇了一個有趣且充滿挑戰的「支線任務」，不僅讓自己獲得樂趣，也為觀眾創造了一場難忘的對局。\n4.  **地圖控制的極致**：Hera 透過不斷騷擾和建造前哨站，牢牢控制了地圖視野，確保他的伐木計畫能順利執行而不被輕易發現。\n5.  **心理戰的威力**：當對手發現自己的森林逐漸消失時，那種無力感和恐慌遠比一次正面會戰的打擊更大。\n\n## 精彩時刻\n- **鮑伯·魯斯時刻**：Hera 將自己用投石車大規模砍樹的過程，形容成一集輕鬆療癒的「鮑伯·魯斯（Bob Ross）繪畫教學」。\n- **邪惡的宣言**：當他透過前哨站觀察對手找不到木材的窘境時，他幸災樂禍地說：「折磨人的重點就是要聽到他們的哀嚎，不然有什麼意義？」\n- **尷尬的友軍傷害**：在他剛嘲諷完「有些職業選手」會誤傷自己的單位後，他立刻就用自己的投石車砸死了自己的部隊。\n- **萬里長城**：遊戲尾聲，他在地圖中央建造了一道橫跨兩端的巨大石牆，徹底斷絕对手机會，並戲稱自己剛從中國回來，看過萬里長城。\n- **對手的陷阱卡**：一名對手在聊天中打出「他中了我的陷阱卡！」，Hera 則一頭霧水地在畫面上尋找根本不存在的陷阱。\n\n---\n\n# Pro Player's Bizarre Strategy: Winning a 1v3 by Deleting All the Wood\n\n## TL;DR\nIn a 1v3 match against beginners, pro player Hera forgoes a quick victory. Instead, he undertakes a massive \"side quest\" to systematically chop down all the wood on his opponents' side of the map, ultimately crippling their economy and forcing them to surrender.\n\n## Story Flow\n- **Beginning**: Hera (a top 10 player) faces three beginner players on the Amazon Tunnel map in a 1v3. He gets the Khitans, a new civilization, and decides on an early scout rush to control the map center and secure relics, compensating for his inability to trade for gold.\n- **Middle**: After a successful initial rush, Hera decides a straightforward win would be boring and embarks on a crazy side quest: to cut down every single tree on his opponents' half of the map. While booming his economy, he sends out waves of \"rocket carts\" (Onagers) to methodically clear the forests. The game becomes a race between Hera's bizarre wood-denial project and his opponents' attempts to build an army.\n- **End**: The game gets intense as the opponents mount a major counter-attack. However, Hera's \"wood control\" strategy proves devastatingly effective. With no wood, the opponents' economies completely collapse, leaving them unable to reseed farms or produce units. Hera seals their fate by building a giant stone wall across the map, winning the highly entertaining game.\n\n## Key Insights\n1.  **Wood is More Critical Than Gold**: In the late game, wood is the lifeblood of the economy. Without it, you can't build farms, buildings, or most units, bringing the economy to a complete halt.\n2.  **Creative Win Conditions**: Victory isn't just about military conquest. By attacking the most fundamental part of an opponent's economy (in this case, wood), you can create an unexpected path to victory.\n3.  **Enjoying the Process**: Instead of simply stomping his opponents, Hera chose a fun and challenging \"side quest\" that not only entertained himself but also created a memorable game for the viewers.\n4.  **The Ultimate Map Control**: Through constant harassment and building outposts, Hera maintained total map vision, ensuring his wood-cutting plan could be executed without being easily discovered.\n5.  **The Power of Psychological Warfare**: The feeling of helplessness and panic an opponent experiences while watching their forests disappear is far more impactful than a single lost battle.\n\n## Notable Moments\n- **The Bob Ross Moment**: Hera described his process of mass-deforestation with Onagers as a relaxing and therapeutic \"Bob Ross episode.\"\n- **A Villainous Declaration**: As he watched his opponents struggle to find wood via his outposts, he gleefully said, \"What's the point of torturing someone if I'm not going to hear them cry out for pain?\"\n- **Ironic Friendly Fire**: Immediately after mocking \"some pros\" for killing their own units with friendly fire, he proceeds to do the exact same thing with his own Onagers.\n- **The Great Wall**: In the endgame, he builds a massive stone wall spanning the entire map to seal off his wood-starved opponents, joking that he just got back from seeing the Great Wall of China.\n- **The Opponent's Trap Card**: One opponent types in chat, \"He fell for my trap card,\" leaving Hera hilariously searching the screen for a non-existent trap.",
      "channel_name": "Hera - Age of Empires 2",
      "channel_id": ""
    },
    {
      "video_id": "oc7IS-t5Ht8",
      "title": "This is How You COUNTER Mass Archers",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-19T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/oc7IS-t5Ht8/mqdefault.jpg",
      "short_summary": "一名1500分的玩家在開局取得巨大優勢後，因錯誤地優先發展經濟（開三座城鎮中心）而非先生產反制單位，幾乎輸給了對手的城堡快攻「奇葩戰術」。他最終憑藉壓倒性的經濟實力艱難取勝，但影片的核心教訓是：面對「all-in」猛攻時，必須優先建立防禦和反制單位，而不是貪圖經濟發展。",
      "full_summary": "# 《如何擊敗城堡快攻「奇葩戰術」－世紀帝國2玩家對戰分析》\n\n## 重點摘要\n一名1500分的玩家在開局取得巨大優勢後，因錯誤地優先發展經濟（開三座城鎮中心）而非先生產反制單位，幾乎輸給了對手的城堡快攻「奇葩戰術」。他最終憑藉壓倒性的經濟實力艱難取勝，但影片的核心教訓是：面對「all-in」猛攻時，必須優先建立防禦和反制單位，而不是貪圖經濟發展。\n\n## 故事大綱\n- **開場：** 玩家Holdfast（使用Wewa文明）完美地防禦了對手（西班牙）的早期資源騷擾，甚至擊殺了對方的斥侯，取得了夢幻般的開局。他隨後發動了封建時代的猛攻，成功壓制了對手。\n- **中段：** 對手選擇龜縮防守，快速升上城堡時代，並開始爆兵征服者，這是一種「all-in」的奇葩戰術。此時Holdfast犯下關鍵失誤：他沒有優先研發科技（如彈道學）或生產反制單位（如茅兵），反而連續蓋了第二和第三座城鎮中心，試圖爆發經濟。這讓對手的征服者部隊滾起雪球，摧毀了Holdfast的軍隊，並對其經濟造成了毀滅性打擊。\n- **結尾：** 儘管軍隊全滅、經濟混亂，Holdfast憑藉著長期以來多出對手一倍的村民數量，終於開始大量生產正確的反制單位（茅兵）。經過一場漫長而艱苦的戰鬥，他利用卓越的經濟潛力最終「淹沒」了對手，贏得了比賽，但過程遠比應有的要艱辛。\n\n## 關鍵見解\n1.  **對抗All-in的鐵則：** 當對手採取一次性猛攻時，必須優先建立軍事反制力量並穩住陣腳，**然後**才考慮擴張經濟。在安全之前，不要貪圖蓋新的城鎮中心。\n2.  **經濟優勢的真相：** 如果你的村民 постоянно被攻擊而無法有效工作，那麼村民數量再多也沒用。一個規模較小但穩定的經濟，遠勝於一個規模龐大但混亂不堪的經濟。\n3.  **關鍵科技的重要性：** 彈道學（Ballistics）對於打擊像征服者這樣的高機動性單位至關重要，應該儘早研發。\n4.  **避免劣勢戰鬥：** 當你擁有經濟優勢時，時間就是你最好的朋友。撤退、集結正確的單位，讓你的優勢慢慢發酵，遠比衝動地打一場沒有把握的仗要好。\n5.  **一個錯誤決策的代價：** 即使開局大優，一個錯誤的戰略決策（例如，在危險時爆經濟而非防守）就足以讓你幾乎輸掉整場比賽。\n\n## 精彩時刻\n- **完美的開局防守：** 影片一開始，Holdfast巧妙地應對騷擾，反殺了對手的斥侯，讓旁述者大加讚賞。\n- **令人扼腕的決策：** 旁述者看到Holdfast在敵人大軍壓境時，竟然還在蓋第三座城鎮中心時，不禁驚呼：「這太瘋狂了！你竟然用三城鎮中心去對抗一個單城鎮爆兵的對手！」\n- **災難性的會戰：** Holdfast在劣勢下貿然開戰，軍隊瞬間蒸發，旁述者評論道：「這是一場糟透的戰鬥…我們被雪球滾死了，完全如我所料。」\n- **最終的教誨：** 旁述者總結道，Holdfast贏了，但「你選了一條最艱難的路」，並詳細解釋了更簡單、更穩妥的應對方法。\n- **「奇葩戰術」玩家的風度：** 對手在輸掉後遲遲不投降，旁述者笑稱：「每次都是這些玩奇葩戰術的傢伙輸不起。」\n\n---\n\n# How to Beat Fast Castle \"Cheese\" - An AoE2 Rec Review\n\n## TL;DR\nA 1500 ELO player, after securing a massive early lead, nearly lost to a \"fast castle\" Conquistador all-in strategy because he greedily expanded his economy (with 3 Town Centers) instead of building counter-units first. He eventually won through sheer economic might, but the video's core lesson is to prioritize defense and counters over booming when facing an all-in.\n\n## Story Flow\n- **Beginning:** The player, Holdfast (as Wewa), brilliantly defends an early resource lame from his Spanish opponent, even killing the enemy scout to gain a huge advantage. He follows up with strong Feudal Age aggression, putting his opponent on the back foot.\n- **Middle:** The opponent plays defensively, rushes to the Castle Age, and begins massing Conquistadors—an \"all-in\" cheese strategy. Holdfast makes a critical error: instead of prioritizing key technologies (like Ballistics) or building counter-units (like Skirmishers), he adds a second and then a third Town Center to boom his economy. This allows the opponent's army to \"snowball,\" crush Holdfast's army, and wreak havoc on his economy.\n- **End:** Despite taking massive damage, Holdfast's superior villager count (often double his opponent's) eventually allows him to mass-produce the correct counter-units (Skirmishers). After a long and difficult fight, he stabilizes and uses his superior economy to overwhelm the opponent, winning the game in a much harder way than necessary.\n\n## Key Insights\n1.  **The Iron Rule vs. All-Ins:** When facing an all-in attack, you must prioritize building a direct military counter and stabilizing your position **before** booming your economy. Don't add Town Centers until you are safe.\n2.  **The Truth About Villager Leads:** A large villager lead is useless if your villagers are constantly being raided and cannot work efficiently. A smaller, stable economy is better than a larger, chaotic one.\n3.  **The Importance of Key Tech:** Ballistics is a crucial upgrade against mobile units like Conquistadors and should be researched early.\n4.  **Avoid Unfavorable Fights:** When you have an economic lead, time is on your side. It's better to fall back, mass the right units, and let your advantage grow rather than taking an impulsive, bad engagement.\n5.  **The Cost of One Wrong Decision:** Even with a massive lead, a single wrong strategic decision (like booming instead of defending) can almost cost you the entire game.\n\n## Notable Moments\n- **The Perfect Opening Defense:** At the start of the video, Holdfast expertly handles the lame and kills the enemy scout, earning high praise from the narrator.\n- **The Facepalm Decision:** The narrator's exasperation upon seeing Holdfast build a third TC while under threat: \"This is insane. You're going 3TC against the guy who's one TC spamming...\"\n- **The Disastrous Engagement:** Holdfast takes a terrible fight and gets his army wiped out, prompting the narrator to say, \"That was a horrible fight... We got snowballed. Exactly like I said.\"\n- **The Final Lesson:** The narrator concludes that Holdfast won, but \"you went the hard route,\" and then explains the much easier, safer way to have handled the situation.\n- **The \"Cheeser's\" Salty End:** The opponent, after his cheese strategy fails, refuses to resign for a long time, with the narrator joking, \"It's always these FC cheesers that get salty at the end.\"",
      "channel_id": ""
    },
    {
      "video_id": "V6U5AhhzM-s",
      "title": "I Want to SEE You in Ranked!",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-21T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/V6U5AhhzM-s/mqdefault.jpg",
      "short_summary": "1.  **What happens**: The speaker pleads to obtain or achieve something and, after a tense moment, succeeds.",
      "full_summary": "Here's a summary:\n\n1.  **What happens**: The speaker pleads to obtain or achieve something and, after a tense moment, succeeds.\n2.  **The point**: The effort and anticipation were completely justified by the satisfying outcome.\n3.  **Vibe**: Triumphant and relieved.",
      "channel_id": ""
    },
    {
      "video_id": "QLt-YezlGXU",
      "title": "POV: You get Matched Against the #1 Player in the World",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-20T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/QLt-YezlGXU/mqdefault.jpg",
      "short_summary": "Here's a summary of the transcript:",
      "full_summary": "Here's a summary of the transcript:\n\n1.  **What happens**: The creator imagines their final video before retirement being an anticlimactic gaming loss, but then gets distracted by a character in the game glitching through the scenery.\n2.  **The point**: The humor lies in the abrupt shift from a self-reflective moment to a random, buggy in-game event.\n3.  **Vibe**: Funny, casual, and random.",
      "channel_id": ""
    },
    {
      "video_id": "uSLcoPv6UAU",
      "title": "Is This How it Feels?!...",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-22T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/uSLcoPv6UAU/mqdefault.jpg",
      "short_summary": "**What happens**: A gamer dismisses an opponent's move as weak, only to be immediately and ironically defeated themselves.",
      "full_summary": "**What happens**: A gamer dismisses an opponent's move as weak, only to be immediately and ironically defeated themselves.\n**The point**: The joke is the instant karma and the player's sudden realization of how it feels to be on the receiving end of a loss.\n**Vibe**: Funny, gaming humor.",
      "channel_id": ""
    },
    {
      "video_id": "ZaNoPHAMe4g",
      "title": "棒球YT小哥的頻道侵權被愛爾達抄掉！在被抄掉之前的收益有多少？為何明知侵權還是不斷有類似的頻道出現？",
      "channel_name": "台南Josh",
      "published_at": "2025-11-20T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/ZaNoPHAMe4g/mqdefault.jpg",
      "short_summary": "一名資深棒球YouTuber「駕馭」，在看見盜用MLB畫面的「小哥」頻道被抄後，感到「心理平衡」。他藉此分享自己多年來遵守版權規定卻步履維艱的辛酸，並坦言曾因盜版者輕鬆獲取暴利而價值觀崩潰。他認為，只要懲罰僅止於下架頻道，巨大的利益仍會驅使盜版者不斷另起爐灶。",
      "full_summary": "# 談小哥事件：一個棒球YouTuber的版權辛酸史\n\n## 重點摘要\n一名資深棒球YouTuber「駕馭」，在看見盜用MLB畫面的「小哥」頻道被抄後，感到「心理平衡」。他藉此分享自己多年來遵守版權規定卻步履維艱的辛酸，並坦言曾因盜版者輕鬆獲取暴利而價值觀崩潰。他認為，只要懲罰僅止於下架頻道，巨大的利益仍會驅使盜版者不斷另起爐灶。\n\n## 故事大綱\n- **開場**：影片開頭，駕馭談論知名棒球頻道「小哥的棒球夾克」因版權問題被永久關播。他澄清，動手的不是MLB官方，而是台灣轉播總代理「愛爾達」。他以此為契機，分享自己作為台灣最早遇到版權問題的棒球YouTuber的親身經歷。\n\n- **中段**：駕馭回憶，他在2018年因使用網路照片被MLB官方警告，從此改變風格，不再使用未授權素材。他詳述了個人創作者向MLB購買影音授權的極度困難（幾乎不可能），這也導致他後來轉向購買中華職棒的版權來製作內容。他對比自己守規矩的辛苦，與小哥頻道靠盜用畫面輕鬆獲取巨額流量和收入（他粗估可能超過兩千萬台幣），並坦承，這種不公平感曾讓他陷入價值觀崩壞，開始懷疑「自己堅持的到底對不對」。\n\n- **結尾**：愛爾達的這次行動，讓他感到「心理稍微平衡一點」，證明了堅持原則並非錯誤。但他發現小哥似乎只是換了頻道繼續上傳，並預測對方未來會轉向盜用更難被追查的國外體育節目。他總結，只要沒有法律追償，盜版背後的龐大利益會讓這種行為不斷發生，而他將以觀察者的角度，繼續看事件如何發展。\n\n## 關鍵見解\n1.  **版權執法的不對等**：遵守版權的創作者在流量競爭上處於絕對劣勢，而不遵守者能輕易獲取巨大流量與利益，形成劣幣驅逐良幣的困境。\n2.  **官方授權管道的缺失**：對於個人創作者而言，即使願意付費，也幾乎沒有管道能向MLB等大型機構購買正規的影音授權，阻礙了優質內容的產出。\n3.  **懲罰力道不足**：僅下架頻道無法有效嚇阻盜版。盜版者鉅額獲利早已入口袋，若無法律追償，他們只會另起爐灶，犯罪成本極低。\n4.  **盜版策略的演化**：為規避查緝，盜版者會不斷進化，轉向翻譯國外談話節目等更難被原始版權方發現的灰色地帶內容，增加追查難度。\n5.  **默許的環境**：在版權方採取行動前，大量觀眾並不在意內容來源，這種「觀眾愛看、官方沒抓」的環境，讓盜版者得以長期存在並坐大。\n\n## 精彩時刻\n- **價值觀崩壞的自白**：「我甚至開始懷疑自己了...會不會其實錯的是我們啊？...我開始覺得自己的心態好糟糕哦，因為他做的東西，就一堆人喜歡，版權方也沒講話，那我為什麼還要一直覺得他是用這種侵權的東西？」\n- **驚人的收入估算**：他以極度保守的方式估算，小哥頻道僅YouTube長影片的收入就可能高達2000多萬台幣，揭示了盜版背後龐大的經濟誘因。\n- **看見盜版頻道被抓的真實感受**：「看的是蠻開心的啊...也不是看到他頻道終於被處理掉了好爽...只會覺得，心理稍微平衡一點啊。」\n- **對盜版者下一步的預測**：「他接下來放的影片...就不要有愛爾達有版權的東西...（改放）國外的棒球相關節目...他們（美國節目方）有可能找到台灣這邊嗎？我覺得機會非常小。」\n\n---\n\n# On the 'Xiao Ge' Incident: A Baseball YouTuber's Copyright Struggles\n\n## TL;DR\nA veteran baseball YouTuber, \"Jiàyù,\" feels a sense of \"psychological balance\" after a major pirating channel, \"Xiao Ge,\" was shut down. He shares his own difficult journey of adhering to copyright rules for years, admitting he once had a crisis of values watching pirates easily make huge profits. He concludes that as long as the penalty is merely a channel takedown, the massive financial incentives will drive pirates to simply start over.\n\n## Story Flow\n- **Beginning**: The video starts with Jiàyù discussing the permanent shutdown of the popular baseball channel \"Xiao Ge's Baseball Jacket\" over copyright issues. He clarifies that the action was taken not by MLB itself, but by its official Taiwanese broadcast partner, ELTA. He uses this event as a jumping-off point to share his own personal history as one of the first Taiwanese baseball YouTubers to face copyright problems.\n\n- **Middle**: Jiàyù recalls being warned by MLB in 2018 for using photos found online, which forced him to change his style and stop using unauthorized materials. He details the extreme difficulty for an individual creator to legitimately license video clips from MLB (it's nearly impossible), which led him to pivot to covering the Taiwanese league (CPBL) after successfully purchasing their video rights. He contrasts his own difficult, rule-abiding path with Xiao Ge's channel, which easily gained massive views and revenue (he roughly estimates over NT$20 million) by using pirated clips. He confesses this unfairness caused him to have a crisis of values, making him wonder if he was the one in the wrong for following the rules.\n\n- **End**: ELTA's action brought him a sense of \"psychological balance,\" validating that his principles weren't misguided. However, he observes that Xiao Ge is reportedly just re-uploading on new channels and predicts they will now pivot to pirating harder-to-trace content like foreign sports talk shows. He concludes that without legal and financial repercussions, the huge profits will ensure this behavior continues, and he will remain an observer to see how the situation unfolds.\n\n## Key Insights\n1.  **Asymmetric Copyright Enforcement**: Creators who respect copyright are at a significant disadvantage in the competition for views, creating a situation where rule-breakers can easily thrive.\n2.  **Lack of Official Licensing Channels**: For individual creators, there are virtually no established channels to purchase video rights from major organizations like MLB, even if they are willing to pay. This stifles the creation of high-quality, legitimate content.\n3.  **Insufficient Penalties**: Simply taking down a channel is an ineffective deterrent. Pirates have already pocketed enormous profits, and without legal action to reclaim earnings, the risk is negligible, and they will just start a new channel.\n4.  **The Evolution of Piracy Tactics**: To evade detection, pirates will evolve, shifting to gray-area content like translating foreign talk shows, which is much harder for the original copyright holders to discover and police.\n5.  **A Permissive Environment**: Before a rights holder takes action, the combination of a large audience that doesn't care about the content's source and official inaction allows piracy to exist and grow for a long time.\n\n## Notable Moments\n- **Confession of a Value Crisis**: \"I even started to doubt myself... could it be that we were the ones who were wrong? ... I started to feel my mentality was terrible. Because so many people liked what he was doing, and the copyright holder said nothing, so why did I keep thinking he was using infringing content?\"\n- **The Staggering Revenue Estimate**: His extremely conservative calculation estimates the pirate channel's YouTube revenue alone could be over NT$20 million (~$650k USD), revealing the massive financial motive behind piracy.\n- **His Honest Reaction to the Takedown**: \"I was quite happy to see it... not in a 'Haha, you finally got what you deserved' way... but more of a feeling of psychological balance.\"\n- **Predicting the Pirate's Next Move**: \"The videos he posts next... just won't have things ELTA has rights to... [he'll use] foreign baseball talk shows... Is it possible for them [the US producers] to find him over here in Taiwan? I think the chances are very small.\""
    },
    {
      "video_id": "aNAb0iPXtqg",
      "title": "兩個台南人完全被法國的甜點收服了！第一餐就直接挑戰吃蝸牛？來場沒做功課的巴黎自由行！【巴黎行EP1】",
      "channel_name": "台南Josh",
      "published_at": "2025-11-18T00:00:00Z",
      "thumbnail": "https://i.ytimg.com/vi/aNAb0iPXtqg/mqdefault.jpg",
      "short_summary": "兩位朋友在巴黎展開一場充滿驚喜與混亂的自由行。他們從搞不定地鐵票開始，一路體驗了道地法國美食、朝聖了著名地標，也學到了「務必提早訂票」的慘痛教訓，影片最後以實用的旅行收納好物工商結尾。",
      "full_summary": "# 巴黎Vlog：凱旋門、蝸牛與可麗餅的混亂冒險\n\n## 重點摘要\n兩位朋友在巴黎展開一場充滿驚喜與混亂的自由行。他們從搞不定地鐵票開始，一路體驗了道地法國美食、朝聖了著名地標，也學到了「務必提早訂票」的慘痛教訓，影片最後以實用的旅行收納好物工商結尾。\n\n## 故事大綱\n- **開場：** 影片一開始，兩位主角抵達巴黎，卻在第一個地鐵站就為了買票卡關了20分鐘。他們對看到法國人真的會拿著法棍麵包走路感到非常興奮，證實了這個「刻板印象」。\n- **中段：** 他們品嚐了經典的法國菜，如蝸牛、牛排和油封鴨，過程中還笨拙地學習如何使用蝸牛夾。接著，他們參觀了凱旋門，在搞不清楚如何穿越圓環馬路後，靠著手機查詢才找到地下通道。旅程還包括協和廣場和羅浮宮。然而，當他們興沖沖地要去地下墓穴時，才發現門票早已預售一空，最近的可購票日期是兩週後，讓他們扼腕不已。\n- **結尾：** 晚上，他們找到一條「可麗餅街」，品嚐了道地的法式可麗餅與蘋果酒 (Cider)。影片的最後一部分，畫風一轉，變成詳細的工商時間，介紹他們旅行使用的 Brandon 收納袋、盥洗包和鞋袋，展示如何用這些工具讓小行李箱也能高效收納。\n\n## 關鍵見解\n1.  **務必提早預訂：** 巴黎許多熱門景點（如羅浮宮、地下墓穴）門票非常搶手，必須提前好幾天甚至好幾週在網路上預訂，無法現場購票。\n2.  **地標的正確抵達方式：** 像凱旋門這樣位於大型車流圓環中央的景點，不能直接穿越馬路，必須尋找專用的地下通道才能抵達。\n3.  **法式美食初體驗：** 蝸牛、油封鴨和法式甜點都是值得一試的經典，特別是法式可麗餅的口感與台灣的完全不同，餅皮柔軟而香氣十足。\n4.  **刻板印象成真：** 在巴黎街頭，真的隨處可見人手一根剛出爐的法棍麵包，這個畫面讓他們覺得非常有趣。\n5.  **旅行收納很重要：** 影片最後的工商環節強調，使用壓縮收納袋等旅行小物，可以大幅節省行李空間，讓輕便旅行成為可能。\n\n## 精彩時刻\n- 在地鐵站花了20分鐘才成功買到票，自嘲「巴黎通」之路遙遠。\n- 看到路人拿著法棍麵包時，發出「法國人！他拿著法國人！」的興奮驚呼。\n- 兩人笨拙地與蝸牛夾奮鬥，差點把蝸牛彈飛的搞笑場面。\n- 發現地下墓穴門票完全賣光，只能在門口看著解說牌「雲端參觀」的失望時刻。\n- 工商時間鉅細靡遺地展示壓縮收納袋「before & after」的驚人效果。\n\n---\n\n# Paris Vlog: A Chaotic Adventure of Arc de Triomphe, Snails & Crêpes\n\n## TL;DR\nTwo friends embark on a spontaneous and chaotic trip to Paris. Starting with confusion over metro tickets, they dive into authentic French cuisine, visit iconic landmarks, and learn a hard lesson about booking tickets in advance. The video concludes with a sponsored segment on practical travel organizers.\n\n## Story Flow\n- **Beginning:** The video opens with the duo arriving in Paris, only to get stuck at the first metro station for 20 minutes trying to buy tickets. They are genuinely thrilled to see locals walking around with baguettes, confirming the famous stereotype.\n- **Middle:** They indulge in a classic French meal, trying escargots, steak, and duck confit, while humorously struggling with the snail tongs. Next, they visit the Arc de Triomphe and, after being baffled by how to cross the massive roundabout, use their phone to discover the underground passage. Their journey continues through the Place de la Concorde and past the Louvre. However, their plan to visit the Catacombs is thwarted when they discover tickets are sold out for weeks, leaving them disappointed.\n- **End:** As evening falls, they find a \"crêpe street\" and enjoy authentic French crêpes with cider. The video's final segment transitions into a detailed sponsored review of Brandon travel organizers, showcasing how to pack efficiently in a small suitcase using their compression bags, toiletry bag, and shoe bag.\n\n## Key Insights\n1.  **Book Everything in Advance:** Many popular Paris attractions (like the Louvre and the Catacombs) are in high demand and require online booking several days or even weeks ahead. On-site tickets are often unavailable.\n2.  **The Right Way to Reach Landmarks:** To get to landmarks located in the middle of heavy traffic, like the Arc de Triomphe, you must look for a dedicated underground passage (\"souterrain\") instead of trying to cross the road.\n3.  **A Taste of French Classics:** Escargots, duck confit, and French desserts are must-try experiences. Notably, French crêpes are soft and fragrant, a completely different texture from what they're used to.\n4.  **Stereotypes Can Be Real:** They found it amusing and exciting that the cliché of Parisians carrying baguettes is a common sight on the streets.\n5.  **Smart Packing is Key:** The sponsored segment highlights that using travel organizers, especially compression packing cubes, can significantly save luggage space and make traveling light much easier.\n\n## Notable Moments\n- Spending 20 minutes at the metro station just to buy a ticket, ironically joking about being \"Paris experts.\"\n- Their excited shouts of \"A French person! He's holding a French bread!\" upon seeing a local with a baguette.\n- The comical struggle with the snail tongs, nearly sending an escargot flying.\n- The moment of realization and disappointment at the Catacombs entrance after finding out it's fully booked.\n- The surprisingly thorough \"before and after\" demonstration of the compression packing cubes during the sponsored segment."
    }
  ],
  "channels": {
    "UCeqc9aYVAZcRQq9Ey0x26AQ": "Hera - Age of Empires 2",
    "UCWAgfxHuoVWm4rmqYwoKvlw": "台南Josh"
  },
  "last_updated": "2025-11-23T23:08:19.694308"
}