{
  "videos": [
    {
      "video_id": "zxPR-1wYJpA",
      "title": "Why Pro Players Love the Khmer",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-22T16:56:12Z",
      "thumbnail": "https://i.ytimg.com/vi/zxPR-1wYJpA/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "The Khmer are an S-tier civilization in Age of Empires 2, not because of their famous late-game elephants, but due to incredibly powerful and subtle early-game economic bonuses. Pros exploit these advantages—like skipping buildings to save resources and having hyper-efficient farms—to create unmatched tempo and defensive resilience, making the Khmer a top-tier pick on open maps.",
      "full_summary": "Here is a summary of the YouTube video transcript, preserving its storyline and narrative flow.\n\n### 1. TL;DR\n\nThe Khmer are an S-tier civilization in Age of Empires 2, not because of their famous late-game elephants, but due to incredibly powerful and subtle early-game economic bonuses. Pros exploit these advantages—like skipping buildings to save resources and having hyper-efficient farms—to create unmatched tempo and defensive resilience, making the Khmer a top-tier pick on open maps.\n\n### 2. Story/Content Flow\n\n**Beginning:** The video opens by contrasting obviously strong civilizations, like the Bohemians, with the Khmer. To a casual player, the Khmer look like a situational, late-game civ reliant on elephants and siege. The host immediately debunks this, stating that pros consider them one of the best civs in the game for reasons that have nothing to do with their elephants.\n\n**Middle:** The core of the video breaks down the four \"secret\" reasons for the Khmer's dominance:\n\n1.  **Extreme Early Game Savings:** The Khmer don't need prerequisite buildings to advance ages or unlock other buildings. This means they can skip the barracks (saving 175 wood and villager build time) and go straight for a stable or range in the Feudal Age. Additionally, their farms deposit food directly into the stockpile without needing a mill or Town Center, providing a faster, more consistent food income that gives them a crucial tempo advantage in producing units like scouts.\n\n2.  **Unique, Powerful Build Orders:** These savings unlock strategies other civs can't do, like an ultra-fast 16-villager scout rush or a 13-minute Fast Castle. While other civs would be economically crippled by such aggressive timings, the Khmer's farming bonus allows them to sustain a strong economy behind it. (The host then makes a shameless, but funny, plug for his Patreon where he provides guides for these builds).\n\n3.  **Incredible Defense via House Garrisoning:** Khmer villagers can garrison inside houses. This seemingly small bonus is game-changing for defense. Players can \"house hop\" to save villagers from raids, making it incredibly risky for an opponent to attack, as they might lose army health without securing any villager kills. It allows the Khmer to defend with minimal investment in walls.\n\n4.  **Impenetrable Scorpion Defense:** In the Castle Age, Khmer scorpions get +1 range, bringing them to 8 range. This outranges almost every standard unit from that age (crossbows, cavalry archers, mangonels). Combined with the Ballistics technology, their scorpions create a defensive wall that is nearly impossible to break, forcing attackers to retreat while taking heavy damage.\n\n**End:** The host concludes by acknowledging the Khmer's minor late-game weaknesses (like missing key infantry and archer technologies) but points out that their powerful elephants serve as the \"finishing blow\" after they've already dominated the entire game. The ultimate takeaway is that the Khmer's strength is unlocked by understanding and using their unique bonuses correctly, making them a powerhouse from the very start. The video ends with a final call to action to subscribe and support the creator on Patreon.\n\n### 3. Key Insights\n\n1.  **Early-Game Bonuses > Late-Game Power:** Small economic advantages in the early game have a much greater impact than large bonuses in the late game, as they dictate the entire tempo and flow of the match.\n2.  **Tempo is Everything:** The Khmer's ability to produce units just a few seconds faster than their opponent is the difference between being the attacker and the defender, a massive advantage in pro play.\n3.  **Defense Can Be an Offensive Weapon:** The Khmer's unique defensive capabilities (house hopping, long-range scorpions) are so effective that they frustrate opponents, drain their resources, and create opportunities for the Khmer player to gain an advantage without even attacking.\n4.  **A Civ's True Strength Can Be Hidden:** The Khmer are a prime example of a civilization whose power isn't in their flashy unique unit but in subtle, synergistic bonuses that require knowledge to exploit fully.\n\n### 4. Notable Moments\n\n*   **The Self-Correction:** \"You need to make a barracks, at least for all other 49 civs in the game... Fine. 48 other cives need the barracks. Back to the Kimr.\"\n*   **The Shameless Patreon Plug:** \"And don't be sad because if you subscribe to my Patreon, you will be able to as well... What are you waiting for? The tournaments are waiting for your kamur. Get in there now and make history today.\"\n*   **The Punchline of Khmer Power:** After detailing how hard they are to attack in the Feudal and Castle ages, the host asks, \"When are you supposed to attack the Kamur player? I don't have an answer. That's why they're so strong.\"\n*   **The Elephant Misconception:** Highlighting that casual players think the Khmer shine with elephants, \"unbeknownst to him the kr have been shining the entire game until you get to the elephants and that's the finishing blow.\""
    },
    {
      "video_id": "JlKV_q3Cml8",
      "title": "I CUT ALL THE WOOD ON AMAZON TUNNEL | 1v3 AoE2",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-21T17:56:30Z",
      "thumbnail": "https://i.ytimg.com/vi/JlKV_q3Cml8/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "Pro *Age of Empires II* player Hera takes on three lower-ranked opponents in a 1v3 match. Instead of going for a quick, dominant victory, he embarks on a \"side quest\" to win by an unconventional strategy: systematically chopping down every single tree on his opponents' side of the map. After a long and methodical game of forest clearing and strategic walling, he completely strangles their economy, leaving them with no wood to play, and forces their surrender.",
      "full_summary": "Of course, here is a summary of the YouTube video transcript.\n\n***\n\n### **1. TL;DR**\n\nPro *Age of Empires II* player Hera takes on three lower-ranked opponents in a 1v3 match. Instead of going for a quick, dominant victory, he embarks on a \"side quest\" to win by an unconventional strategy: systematically chopping down every single tree on his opponents' side of the map. After a long and methodical game of forest clearing and strategic walling, he completely strangles their economy, leaving them with no wood to play, and forces their surrender.\n\n### **2. Story/Content Flow**\n\n*   **Beginning:** Hera introduces the 1v3 matchup on the Amazon Tunnel map, highlighting the significant skill gap between himself (Rank 10) and his opponents (Ranks 600-850). Deciding to have fun rather than just stomp them, he starts with a fast scout rush to apply early pressure, secure map control, and gather all five relics for a gold advantage.\n\n*   **Middle:** After his initial attack succeeds in disrupting his opponents, Hera pivots to his main, self-imposed challenge: the \"wood control\" strategy. He begins a long, meticulous process of using siege units (Rocket Carts) to cut down the entire forest on the enemy's half of the map. This becomes a \"Bob Ross\"-like side quest, as he methodically clears vast sections of trees, all while his opponents are unaware of his ultimate plan. There are several back-and-forth skirmishes, and at one point the opponents mount a serious attack that forces Hera to \"sit up\" and defend, but his primary focus remains on methodically erasing their woodlines.\n\n*   **End:** The strategy culminates in Hera completely devastating the opponents' economy. With no access to wood, they are unable to build new structures, create units, or even replenish their farms. Hera builds outposts to watch them suffer and eventually constructs a massive stone wall across the map, sealing them off from the last remaining trees. Starved of the game's most crucial resource, his opponents' villagers go idle, and they are forced to call \"GG.\" Hera reflects on the memorable and fun nature of the game, happy that his creative challenge led to a unique victory.\n\n### **3. Key Insights**\n\n1.  **Wood is the Ultimate Resource:** The game demonstrates that while gold is important, wood is the absolute lifeblood of an economy. Without it, you can't build, farm, or fight, making wood denial a devastating (though slow) win condition.\n2.  **Creative Strategies Make for Memorable Games:** Instead of a standard victory, Hera created a unique challenge for himself. This not only made the game more balanced and fun for his opponents but also created far more entertaining content.\n3.  **The Power of a Methodical Plan:** Hera's victory wasn't won through pure speed or mechanics, but through the patient and meticulous execution of a long-term, unconventional plan that his opponents didn't see coming until it was too late.\n4.  **Don't Underestimate Late-Game Economies:** Hera notes that while beginner players often struggle in the early game, their late-game economies can become surprisingly powerful if they are given time to build up, which they were in this match.\n\n### **4. Notable Moments**\n\n*   **The \"Side Quest\":** The moment Hera decides against a quick win and commits to the absurdly epic task of cutting down half the map's forest.\n*   **\"Bob Ross Cutting the Forest\":** Hera's description of the relaxing, satisfying process of clearing trees with his siege units, turning a slow strategy into a zen-like activity.\n*   **The Villager Strike:** His delight in seeing the enemy villagers standing idle because there was literally no wood left for them to chop, exclaiming, \"The villagers are going on strike!\"\n*   **The Final Wall:** The climactic act of building a massive stone wall to permanently lock the opponents out of their last remaining wood patches, sealing their fate.\n*   **Friendly Fire:** After commenting on how some pro players accidentally kill their own units, Hera immediately does the exact same thing with his own siege, laughing at himself."
    },
    {
      "video_id": "oc7IS-t5Ht8",
      "title": "How to Beat the Phosphoru Conquistador Rush | 1500 Elo Coaching",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-20T16:52:11Z",
      "thumbnail": "https://i.ytimg.com/vi/oc7IS-t5Ht8/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "This is a review of a 1500 ELO Age of Empires II match where the player, Holdfast, faces an aggressive \"fast castle\" Conquistador strategy. Although Holdfast wins, he takes the \"hard route\" by prioritizing a risky economic boom (3 Town Centers) instead of building a direct military counter first. The core lesson is that against an all-in rush, you must stabilize with a proper army and key upgrades *before* expanding your economy, as a large but idle villager lead is useless.",
      "full_summary": "Here is a summary of the YouTube video transcript.\n\n### **1. TL;DR**\n\nThis is a review of a 1500 ELO Age of Empires II match where the player, Holdfast, faces an aggressive \"fast castle\" Conquistador strategy. Although Holdfast wins, he takes the \"hard route\" by prioritizing a risky economic boom (3 Town Centers) instead of building a direct military counter first. The core lesson is that against an all-in rush, you must stabilize with a proper army and key upgrades *before* expanding your economy, as a large but idle villager lead is useless.\n\n### **2. Story/Content Flow**\n\n*   **Beginning:** The game starts with Holdfast's opponent attempting to \"lame\" him by stealing his resources. Holdfast executes a perfect defense, killing the enemy's scout and gaining a huge early advantage. He then launches his own attack with Men-at-Arms, applying strong feudal age pressure and forcing the opponent into a defensive position.\n\n*   **Middle:** The opponent responds by rushing to the Castle Age to spam Conquistadors and Siege—a classic \"all-in cheese\" strategy. This is the critical turning point. Instead of building a counter-army (like Skirmishers and Monks) and getting the essential \"Ballistics\" upgrade, Holdfast greedily adds two extra Town Centers. The narrator heavily criticizes this, explaining that you can't out-boom an all-in attack. As predicted, Holdfast's army gets crushed, he takes a horrible fight under the enemy's new forward castle, and gets \"snowballed,\" losing map control and momentum.\n\n*   **End:** Despite losing his army and having his base overrun, Holdfast's massive villager lead (often double his opponent's) keeps him in the game. After a long, chaotic period of defending and scrambling, he finally stabilizes, masses the *correct* counter-units (Skirmishers and cavalry), and expands his economy across the map. His superior economy eventually overwhelms the one-dimensional opponent, securing a hard-fought win. The narrator concludes by showing how the game could have been won much more easily by simply staying on 1-2 Town Centers, getting Ballistics, and building a counter-army to shut down the rush in the Castle Age.\n\n### **3. Key Insights**\n\n1.  **Countering All-Ins:** The #1 rule when facing an \"all-in\" strategy is to prioritize defense over economy. Build a direct military counter and get crucial upgrades (like Ballistics vs. Conquistadors) *before* adding more Town Centers. A 2-TC build is the max you should consider.\n2.  **A Stable Economy Beats a Larger, Idle One:** Holdfast had a massive villager lead for most of the game, but it meant little because his villagers were constantly being raided, forced to garrison, or unable to work efficiently. A smaller, secure economy is far more effective than a larger, chaotic one.\n3.  **Patience Pays Off When Ahead:** If you have the economic advantage, the game is on your clock. There is no need to rush into bad fights. Holdfast took a disastrous engagement when he could have simply waited for his Imperial Age upgrades, which would have made the fight trivial.\n4.  **The \"Easy Route\" vs. The \"Hard Route\":** The player won via the \"hard route\"—surviving by the skin of his teeth and eventually out-producing the enemy. The \"easy route\" was to identify the threat and build a specific, efficient counter to neutralize it early on, leading to a much cleaner victory.\n\n### **4. Notable Moments**\n\n*   **The Perfect Defense:** The video opens with the opponent trying to be clever and steal resources, only to lose his scout for nothing. The narrator is ecstatic: \"Oh my goodness. You taught that guy a lesson. That's really good.\"\n*   **The 3rd TC Mistake:** The narrator's disbelief when Holdfast adds a third Town Center against the all-in rush: \"A third TC. Oh my goodness. This is insane... That's so risky.\"\n*   **The Disastrous Fight:** The narrator facepalms as Holdfast throws his entire army away in a fight he can't possibly win: \"Oh, that's a horrible fight. Wait, why did we take this fight? We got snowballed. Exactly like I said.\"\n*   **The Salty Opponent:** After being ground down and defeated, the opponent with the \"cheese\" strategy refuses to resign. The narrator remarks, \"It's always these FC cheesers that get salty at the end.\""
    },
    {
      "video_id": "V6U5AhhzM-s",
      "title": "Quick Walling is an Addiction, HELP!",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-20T21:18:50Z",
      "thumbnail": "https://i.ytimg.com/vi/V6U5AhhzM-s/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "Here's a brief summary:",
      "full_summary": "Here's a brief summary:\n\n1.  **What happens**: Someone pleads to get something, and after a moment of anticipation, they succeed and declare it was completely worth the effort.\n2.  **The point**: The feeling of triumph and satisfaction after finally achieving a difficult goal.\n3.  **Vibe**: Triumphant and satisfying."
    },
    {
      "video_id": "QLt-YezlGXU",
      "title": "So uh... We Got a New Bug",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-21T20:51:48Z",
      "thumbnail": "https://i.ytimg.com/vi/QLt-YezlGXU/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "Here's a brief summary:",
      "full_summary": "Here's a brief summary:\n\n1.  **What happens**: The speaker imagines their last video before retirement being an anticlimactic loss in a video game. They get distracted when a character in the game glitches and walks through a solid line of trees.\n2.  **The point**: The humor comes from the anticlimactic retirement plan and the sudden, absurd in-game bug.\n3.  **Vibe**: Funny and casual."
    },
    {
      "video_id": "JdXZ1b-wX-8",
      "title": "開箱巴黎路邊的公廁！嬙姐聽到驚喜的反應是？【巴黎行EP2】",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-21T12:31:38Z",
      "thumbnail": "https://i.ytimg.com/vi/JdXZ1b-wX-8/mqdefault.jpg",
      "description": "現在透過我的專屬優惠連結 https://nordvpn.com/tainanjosh\n或是結帳時輸入優惠碼【tainanjosh】購買的話，兩年方案可以加贈四個月，三十天無條件退費，不滿意可以隨時取消，申請退款，有需要的朋友可以試試看哦！\n\n歡迎加入我的頻道會員\nhttps://reurl.cc/jnWGm\n每個月75元小額贊助來幫助台南Josh頻道變得更好\n\n台南Josh Line貼圖上架囉\n",
      "short_summary": "I can do that. First, I'll retrieve the video's transcript to create the summary.",
      "full_summary": "I can do that. First, I'll retrieve the video's transcript to create the summary."
    },
    {
      "video_id": "aNAb0iPXtqg",
      "title": "兩個台南人完全被法國的甜點收服了！第一餐就直接挑戰吃蝸牛？來場沒做功課的巴黎自由行！【巴黎行EP1】",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-14T12:32:15Z",
      "thumbnail": "https://i.ytimg.com/vi/aNAb0iPXtqg/mqdefault.jpg",
      "description": "⧓ Josh x 韓國BRANDEN 二代超強收納袋團 ⧓ \n☞ 團購連結： https://gbf.tw/0okae\n..................\n⧓ 團購期間\n    2025/11/14 (週五)~2025/11/21 (週五) 晚上11:59收單截止\n⧓ 出貨時間\n    ⬭ 現貨商品：付款後3~5個工作天出貨(不含國定假日及例假日)\n    ⬭ 預購商品：1/7起依訂單順序出貨\n",
      "short_summary": "",
      "full_summary": ""
    },
    {
      "video_id": "ZaNoPHAMe4g",
      "title": "棒球YT小哥的頻道侵權被愛爾達抄掉！在被抄掉之前的收益有多少？為何明知侵權還是不斷有類似的頻道出現？",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-13T16:35:15Z",
      "thumbnail": "https://i.ytimg.com/vi/ZaNoPHAMe4g/mqdefault.jpg",
      "description": "我出的第一本書  嗨嗨，我是Josh！ 開賣啦\n誠品線上：https://www.eslite.com/product/10012012142682574740001\n博客來：https://www.books.com.tw/products/0010989928\n啟明官網：https://www.chimingpublishing.com/book/josh/e/72a4a2\n\n歡迎加入我的頻道",
      "short_summary": "",
      "full_summary": ""
    },
    {
      "video_id": "0HApz1K-ass",
      "title": "《寶可夢傳說Z-A》04 沒有要烤肉也沒有要講什麼 只是要來把寶可夢破關",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-11T18:16:41Z",
      "thumbnail": "https://i.ytimg.com/vi/0HApz1K-ass/mqdefault.jpg",
      "description": "",
      "short_summary": "",
      "full_summary": ""
    },
    {
      "video_id": "WI6CTgbB1u0",
      "title": "《寶可夢傳說Z-A》04 沒有要烤肉也沒有要講什麼 只是要來把寶可夢破關",
      "channel_id": "UCWAgfxHuoVWm4rmqYwoKvlw",
      "channel_name": "台南Josh",
      "published_at": "2025-11-11T18:07:55Z",
      "thumbnail": "https://i.ytimg.com/vi/WI6CTgbB1u0/mqdefault_live.jpg",
      "description": "",
      "short_summary": "Okay, I will summarize the YouTube video for you. First, I'll analyze the project's existing code to understand how to best process the video.The project seems well-equipped for this. According to the",
      "full_summary": "Okay, I will summarize the YouTube video for you. First, I'll analyze the project's existing code to understand how to best process the video.The project seems well-equipped for this. According to the `README.md`, it can fetch transcripts and summarize them. I'll examine `src/main.py` to determine the best way to handle a single video URL.`src/main.py` is for summarizing channels, not single videos. I'll need to use its components directly. I'll extract the video ID from the URL, then use the `get_transcript` and `summarize` functions to get the content and create the summary, which I will then format as requested. I'll start by examining `src/transcript.py`.Okay, `src/transcript.py`'s `get_transcript` function will give me the video transcript from its ID. Now, I'll check `src/summarizer.py` to see how to create the summary.`summarizer.py` is ideal. It uses a `summarize` function with a 'gemini' provider option and even has a `summarize_video_url_with_gemini` fallback. The prompt within matches the user's request perfectly. My plan is to extract the video ID, then call `gemini` with the video URL and the predefined prompt, presenting the resulting `full_summary`. I'll execute this via a shell command.I need to summarize a YouTube video, but I can't use `run_shell_command`. I'll have to re-implement the project's transcript and summarization logic using my available tools. I'll start by checking `requirements.txt` to see if `youtube-transcript-api` is already installed.I can't use shell commands, so I'll pivot. I'll act as the `gemini` model from `summarizer.py`. First, I'll use `web_fetch` to get the video's title and confirm access. Then, I'll generate the summary myself following the user's format. I'll start with `web_fetch`."
    },
    {
      "video_id": "uSLcoPv6UAU",
      "title": "Is This How it Feels?!...",
      "channel_id": "UCeqc9aYVAZcRQq9Ey0x26AQ",
      "channel_name": "Hera - Age of Empires 2",
      "published_at": "2025-11-22T21:30:32Z",
      "thumbnail": "https://i.ytimg.com/vi/uSLcoPv6UAU/mqdefault.jpg",
      "description": "My Patreon: https://www.patreon.com/heraaoe2\nMy Store: https://hera.merchforall.com\nMy Twitch:   https://www.twitch.tv/Hera\nMy Gameplay Channel: youtube.com/@Hera-Gameplay\nMy TikTok:   https://www.tik",
      "short_summary": "**What happens**: A gamer effortlessly destroys a weak \"65 HP gate\" and then has a moment of realization, wondering if this is how their overpowered strength feels to their opponents.",
      "full_summary": "**What happens**: A gamer effortlessly destroys a weak \"65 HP gate\" and then has a moment of realization, wondering if this is how their overpowered strength feels to their opponents.\n**The point**: The joke is the gamer's sudden, slightly delayed empathy for how frustrating it must be to play against them.\n**Vibe**: Funny, gaming."
    }
  ],
  "channels": {
    "UCeqc9aYVAZcRQq9Ey0x26AQ": "Hera - Age of Empires 2",
    "UCWAgfxHuoVWm4rmqYwoKvlw": "台南Josh"
  },
  "last_updated": "2025-11-23T15:29:45.311472"
}